cmsis-svd/cmsis-svd/data/NXP/LPC178x7x.svd
				</field>
				<field>
					<name>EPERRINTST1</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[1:1]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST2</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[2:2]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST3</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[3:3]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST4</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[4:4]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST5</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[5:5]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST6</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[6:6]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST7</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[7:7]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST8</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[8:8]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST9</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[9:9]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST10</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[10:10]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST11</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[11:11]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST12</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[12:12]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST13</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[13:13]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST14</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[14:14]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST15</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[15:15]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST16</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[16:16]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST17</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[17:17]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST18</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[18:18]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST19</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[19:19]</bitRange>
										
