cmsis-svd/cmsis-svd/data/NXP/LPC178x7x.svd
				</field>
				<field>
					<name>EPERRINTST20</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[20:20]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST21</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[21:21]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST22</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[22:22]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST23</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[23:23]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST24</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[24:24]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST25</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[25:25]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST26</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[26:26]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST27</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[27:27]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST28</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[28:28]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST29</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[29:29]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST30</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[30:30]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTST31</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = There is no System Error Interrupt request for endpoint xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
					<bitRange>[31:31]</bitRange>
										
				</field>
			</fields>
		</register>
		<register>
			<name>SYSERRINTCLR</name>
			<description>USB System Error Interrupt Clear</description>
			<addressOffset>0x2BC</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EPERRINTCLR0</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[0:0]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR1</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[1:1]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR2</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[2:2]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR3</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[3:3]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR4</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[4:4]</bitRange>
										
				</field>
				<field>
					<name>EPERRINTCLR5</name>
					<description>Clear endpoint xx (2 &lt;= xx  &lt;= 31) System Error Interrupt request. 0 = No effect. 1 = Clear the EPxx System Error Interrupt request in the USBSysErrIntSt register.</description>
					<bitRange>[5:5]</bitRange>
										
