cmsis-svd/cmsis-svd/data/NXP/LPC178x7x.svd
   <register>
      <name>P2_17</name>
      <description>I/O configuration register for pin P2[17]</description>
      <addressOffset>0x144</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000030</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P2[17]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P2_17</name>
                  <description>General purpose digital input/output
                                            pin.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>EMC_RAS</name>
                  <description>LOW active SDRAM Row Address Strobe.</description>
                  <value>0x1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor
                        control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor
                                enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin
                                reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as
                                1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[8:7]</bitRange>
         </field>
         <field>
            <name>SLEW</name>
            <description>Driver slew rate</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>STANDARD</name>
                  <description>Standard mode, output slew rate control is enabled. More
                                outputs can be switched simultaneously.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast mode, slew rate control is disabled. Refer to the
                                appropriate specific device data sheet for details.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain
                                mode. Input cannot be pulled up above VDD.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
   <register>
      <name>P2_18</name>
      <description>I/O configuration register for pin P2[18]</description>
      <addressOffset>0x148</addressOffset>
      <access>read-write</access>
      <resetValue>0x000001B0</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P2[18]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P2_18</name>
                  <description>General purpose digital input/output
                                            pin.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>EMC_CLK_0</name>
                  <description>SDRAM clock 0.</description>
                  <value>0x1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor
                        control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor
                                enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin
                                reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as
                                1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>ADMODE</name>
            <description>Selects Analog/Digital mode.</description>
            <bitRange>[7:7]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>ANALOG_INPUT_MODE_</name>
                  <description>Analog input mode.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>DIGITAL_FUNCTIONAL_M</name>
                  <description>Digital functional mode.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>FILTR</name>
            <description>Selects 10 ns input glitch filter.</description>
            <bitRange>[8:8]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>FILTER_DISABLED_</name>
                  <description>Filter disabled.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FILTER_ENABLED_</name>
                  <description>Filter enabled.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[9:9]</bitRange>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain
                                mode.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
   <register>
      <name>P2_19</name>
      <description>I/O configuration register for pin P2[19]</description>
      <addressOffset>0x14C</addressOffset>
      <access>read-write</access>
      <resetValue>0x000001B0</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P2[19]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P2_19</name>
                  <description>General purpose digital input/output
                                            pin.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>EMC_CLK_1</name>
                  <description>SDRAM clock 1.</description>
                  <value>0x1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor
                        control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor
                                enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin
                                reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as
                                1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>ADMODE</name>
            <description>Selects Analog/Digital mode.</description>
            <bitRange>[7:7]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>ANALOG_INPUT_MODE_</name>
                  <description>Analog input mode.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>DIGITAL_FUNCTIONAL_M</name>
                  <description>Digital functional mode.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>FILTR</name>
            <description>Selects 10 ns input glitch filter.</description>
            <bitRange>[8:8]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>FILTER_DISABLED_</name>
                  <description>Filter disabled.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FILTER_ENABLED_</name>
                  <description>Filter enabled.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[9:9]</bitRange>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain
                                mode.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
