cmsis-svd/cmsis-svd/data/NXP/LPC178x7x.svd
						</field>
						<field>
							<name>ABORT</name>
							<description>Fast abort interrupt.</description>
							<bitRange>[15:15]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>INTERRUPT_DISABLED_</name>
									<description>Interrupt disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERRUPT_ENABLED_</name>
									<description>Interrupt enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:16]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>INTEN_SET</name>
					<description>Interrupt Enable set address</description>
					<addressOffset>0x054</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ILIM0_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>IMAT0_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>ICAP0_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>ILIM1_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>IMAT1_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>ICAP1_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>ILIM2_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>IMAT2_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>ICAP2_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[11:11]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[14:12]</bitRange>
						</field>
						<field>
							<name>ABORT_SET</name>
							<description>Writing a one sets the corresponding bit in INTEN, thus enabling the interrupt.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTEN_CLR</name>
					<description>Interrupt Enable clear address</description>
					<addressOffset>0x058</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ILIM0_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>IMAT0_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[1:1]</bitRange>
						</field>
						<field>
							<name>ICAP0_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[2:2]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[3:3]</bitRange>
						</field>
						<field>
							<name>ILIM1_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[4:4]</bitRange>
						</field>
						<field>
							<name>IMAT1_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[5:5]</bitRange>
						</field>
						<field>
							<name>ICAP1_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[6:6]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[7:7]</bitRange>
						</field>
						<field>
							<name>ILIM2_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[8:8]</bitRange>
						</field>
						<field>
							<name>IMAT2_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[9:9]</bitRange>
						</field>
						<field>
							<name>ICAP2_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[10:10]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[14:11]</bitRange>
						</field>
						<field>
							<name>ABORT_CLR</name>
							<description>Writing a one clears the corresponding bit in INTEN, thus disabling the interrupt.</description>
							<bitRange>[15:15]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>INTF</name>
					<description>Interrupt flags read address</description>
					<addressOffset>0x068</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ILIM0_F</name>
							<description>Limit interrupt flag for channel 0.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THIS_INTERRUPT_SOURC</name>
									<description>This interrupt source is not contributing to the MCPWM interrupt request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IF_THE_CORRESPONDING</name>
									<description>If the corresponding bit in INTEN is 1, the MCPWM module is asserting its interrupt request to the Interrupt Controller.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IMAT0_F</name>
							<description>Match interrupt flag for channel 0.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THIS_INTERRUPT_SOURC</name>
									<description>This interrupt source is not contributing to the MCPWM interrupt request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IF_THE_CORRESPONDING</name>
									<description>If the corresponding bit in INTEN is 1, the MCPWM module is asserting its interrupt request to the Interrupt Controller.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ICAP0_F</name>
							<description>Capture interrupt flag for channel 0.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>THIS_INTERRUPT_SOURC</name>
									<description>This interrupt source is not contributing to the MCPWM interrupt request.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IF_THE_CORRESPONDING</name>
									<description>If the corresponding bit in INTEN is 1, the MCPWM module is asserting its interrupt request to the Interrupt Controller.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[3:3]</bitRange>
							
